/*****************************************************************************************************
 * 本代码版权归Wenli所有，All Rights Reserved (C) 2015-2016
 *****************************************************************************************************
 * 所属域：WENLI-PC
 * 登录用户：Administrator
 * CLR版本：4.0.30319.17929
 * 唯一标识：20da4241-0bdc-4a06-8793-6d0889c31f95
 * 机器名称：WENLI-PC
 * 联系人邮箱：wenguoli_520@qq.com
 *****************************************************************************************************
 * 命名空间：MCITest


 * 创建年份：2015
 * 创建时间：2015-12-02 11:15:24
 * 创建人：Wenli
 * 创建说明：
 *****************************************************************************************************/

namespace GFF.Core.Http
{
    /// <summary>
    ///     HttpListenner监听Post请求参数值实体
    /// </summary>
    public class HttpPostItem
    {
        public byte[] datas;
        public string name;

        /// <summary>
        ///     0=> 参数
        ///     1=> 文件
        /// </summary>
        public int type = 0;
    }
}