/*****************************************************************************************************
 * 本代码版权归@wenli所有，All Rights Reserved (C) 2015-2016
 *****************************************************************************************************
 * CLR版本：4.0.30319.42000
 * 唯一标识：6077c3a9-e57d-4868-bd1b-1549e6421288
 * 机器名称：WENLI-PC
 * 联系人邮箱：wenguoli_520@qq.com
 *****************************************************************************************************
 * 项目名称：$projectname$
 * 命名空间：GFF.Model.Enum
 * 类名称：VideoSizeModel
 * 创建时间：2016/11/10 17:17:18
 * 创建人：wenli
 * 创建说明：
 *****************************************************************************************************/
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace GFF.Model.Enum
{
    /// <summary>
    /// 视频模式
    /// </summary>
    public enum VideoSizeModel
    {
        /// <summary>
        /// 捕获视频大小宽为160，高120像素
        /// </summary>
        W160_H120,
        /// <summary>
        /// 捕获视频大小宽为176，高144像素
        /// </summary>
        W176_H144,
        /// <summary>
        /// 捕获视频大小宽为320，高240像素
        /// </summary>
        W320_H240,
        /// <summary>
        /// 捕获视频大小宽为352，高288像素
        /// </summary>
        W352_H288,
        /// <summary>
        /// 捕获视频大小宽为640，高480像素
        /// </summary>
        W640_H480,
        /// <summary>
        /// 捕获视频大小宽为800，高600像素
        /// </summary>
        W800_H600,
    }
}
